# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
List = [1,2,3,4]
array = np.array([10,20,30,40])
d = {'a':10,'b':20,'c':30,'d':40}

In [4]:
Series1 = pd.Series(List)

In [5]:
Series1

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
Series2 = pd.Series(array)

In [7]:
Series2

0    10
1    20
2    30
3    40
dtype: int32

In [8]:
Series3 = pd.Series(d)

In [9]:
Series3

a    10
b    20
c    30
d    40
dtype: int64

In [10]:
s1 = pd.Series(List,index=['Ms','Ds','Es','Dm'])

In [11]:
s1

Ms    1
Ds    2
Es    3
Dm    4
dtype: int64

In [12]:
s1['Ms']

1

In [13]:
s1['Es']

3

In [14]:
s1[['Ds','Dm']]

Ds    2
Dm    4
dtype: int64

In [15]:
s1[:]

Ms    1
Ds    2
Es    3
Dm    4
dtype: int64

In [16]:
s1[0:3]

Ms    1
Ds    2
Es    3
dtype: int64

In [17]:
s1[1: : 2]

Ds    2
Dm    4
dtype: int64

In [19]:
s1[0:3:1]

Ms    1
Ds    2
Es    3
dtype: int64

In [20]:
s1.index

Index(['Ms', 'Ds', 'Es', 'Dm'], dtype='object')

In [21]:
s1.dtype

dtype('int64')

# Data Frames

In [22]:
df =pd.DataFrame(np.random.randint(-4,20,20).reshape(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [23]:
df

    W   X   Y   Z
A  14  14   3   7
B  14  17   4   3
C   7  11   8  12
D  -1  12   7  17
E  10   3  17   5

In [24]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [25]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [26]:
df['W']

A    14
B    14
C     7
D    -1
E    10
Name: W, dtype: int32

In [30]:
df[['X','Z']]

    X   Z
A  14   7
B  17   3
C  11  12
D  12  17
E   3   5

In [32]:
df[['X','Y','Z']]

    X   Y   Z
A  14   3   7
B  17   4   3
C  11   8  12
D  12   7  17
E   3  17   5

In [33]:
df['Add']=df['X']+df['Z']

In [34]:
df

    W   X   Y   Z  Add
A  14  14   3   7   21
B  14  17   4   3   20
C   7  11   8  12   23
D  -1  12   7  17   29
E  10   3  17   5    8

In [35]:
df['Div']=df['W']/df['Y']

In [36]:
df

    W   X   Y   Z  Add       Div
A  14  14   3   7   21  4.666667
B  14  17   4   3   20  3.500000
C   7  11   8  12   23  0.875000
D  -1  12   7  17   29 -0.142857
E  10   3  17   5    8  0.588235

In [38]:
df.drop('Add',axis=1,inplace=True)

In [39]:
df

    W   X   Y   Z       Div
A  14  14   3   7  4.666667
B  14  17   4   3  3.500000
C   7  11   8  12  0.875000
D  -1  12   7  17 -0.142857
E  10   3  17   5  0.588235

In [40]:
df.drop('Div',axis=1,inplace=True)

In [41]:
df

    W   X   Y   Z
A  14  14   3   7
B  14  17   4   3
C   7  11   8  12
D  -1  12   7  17
E  10   3  17   5

In [42]:
df.loc['A']

W    14
X    14
Y     3
Z     7
Name: A, dtype: int32

In [43]:
df.loc[['B','C']]

    W   X  Y   Z
B  14  17  4   3
C   7  11  8  12

In [45]:
df.iloc[[0,1]]

    W   X  Y  Z
A  14  14  3  7
B  14  17  4  3

In [46]:
df.iloc[3]

W    -1
X    12
Y     7
Z    17
Name: D, dtype: int32

In [48]:
df.loc['F']=df.loc['D']-df.loc['E']

In [49]:
df

    W   X   Y   Z
A  14  14   3   7
B  14  17   4   3
C   7  11   8  12
D  -1  12   7  17
E  10   3  17   5
F -11   9 -10  12

In [50]:
df.loc['G']=df.iloc[0]*df.iloc[5]

In [51]:
df

     W    X   Y   Z
A   14   14   3   7
B   14   17   4   3
C    7   11   8  12
D   -1   12   7  17
E   10    3  17   5
F  -11    9 -10  12
G -154  126 -30  84

In [53]:
df.drop('F',axis=0,inplace=True)

In [54]:
df

     W    X   Y   Z
A   14   14   3   7
B   14   17   4   3
C    7   11   8  12
D   -1   12   7  17
E   10    3  17   5
G -154  126 -30  84

In [57]:
df.drop('G',axis=0,inplace=True)

In [58]:
df

    W   X   Y   Z
A  14  14   3   7
B  14  17   4   3
C   7  11   8  12
D  -1  12   7  17
E  10   3  17   5

In [60]:
df.loc['A','W']

14

In [61]:
df.iloc[2,2]

8

In [62]:
df.loc[['B','C','D'],['X','Y','Z']]

    X  Y   Z
B  17  4   3
C  11  8  12
D  12  7  17

In [63]:
df.iloc[[0,2,4],[1,2,3]]

    X   Y   Z
A  14   3   7
C  11   8  12
E   3  17   5

In [64]:
df

    W   X   Y   Z
A  14  14   3   7
B  14  17   4   3
C   7  11   8  12
D  -1  12   7  17
E  10   3  17   5

In [65]:
df>1

       W     X     Y     Z
A   True  True  True  True
B   True  True  True  True
C   True  True  True  True
D  False  True  True  True
E   True  True  True  True

In [66]:
df[df<1]

     W   X   Y   Z
A  NaN NaN NaN NaN
B  NaN NaN NaN NaN
C  NaN NaN NaN NaN
D -1.0 NaN NaN NaN
E  NaN NaN NaN NaN

In [67]:
df[df>0]

      W   X   Y   Z
A  14.0  14   3   7
B  14.0  17   4   3
C   7.0  11   8  12
D   NaN  12   7  17
E  10.0   3  17   5

In [71]:
df[df['Z']>4]

    W   X   Y   Z
A  14  14   3   7
C   7  11   8  12
D  -1  12   7  17
E  10   3  17   5

In [76]:
df[df['W']>4] ['X']

A    14
B    17
C    11
E     3
Name: X, dtype: int32

In [78]:
df[df['X']>2][['W','Y','Z']]

    W   Y   Z
A  14   3   7
B  14   4   3
C   7   8  12
D  -1   7  17
E  10  17   5

In [79]:
df[(df['W']>2) & (df['Y']>3)]

    W   X   Y   Z
B  14  17   4   3
C   7  11   8  12
E  10   3  17   5

In [80]:
df[(df['X']>=4) | (df['Z']<=3)]

    W   X  Y   Z
A  14  14  3   7
B  14  17  4   3
C   7  11  8  12
D  -1  12  7  17

In [111]:
df

        W   X   Y   Z Names
Names
USA    14  14   3   7   USA
ENG    14  17   4   3   ENG
NA      7  11   8  12    NA
NW     -1  12   7  17    NW
SA     10   3  17   5    SA

In [112]:
df.reset_index()

ValueError: cannot insert Names, already exists

In [113]:
newind = 'USA ENG NA NW SA'.split()

In [114]:
df['Names']=newind

In [115]:
df

        W   X   Y   Z Names
Names
USA    14  14   3   7   USA
ENG    14  17   4   3   ENG
NA      7  11   8  12    NA
NW     -1  12   7  17    NW
SA     10   3  17   5    SA

In [116]:
df.set_index('Names',inplace=True)

In [117]:
df

        W   X   Y   Z
Names
USA    14  14   3   7
ENG    14  17   4   3
NA      7  11   8  12
NW     -1  12   7  17
SA     10   3  17   5

In [118]:
Grade = ['G1','G1','G2','G2']
Marks = [10,20,10,20]
hier_index = list(zip(Grade,Marks))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [119]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [10, 20]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [120]:
df=pd.DataFrame(np.random.randn(4,2),index=hier_index,columns=['A','B'])

In [121]:
df

              A         B
G1 10 -0.824474 -3.048758
   20 -0.150286 -0.816731
G2 10  1.213255 -0.467578
   20  0.827297  1.084870

In [123]:
df.loc['G1']

           A         B
10 -0.824474 -3.048758
20 -0.150286 -0.816731

In [127]:
df.loc['G2']

           A         B
10  1.213255 -0.467578
20  0.827297  1.084870

In [128]:
df.index.names = ['Grade','Marks']

In [129]:
df

                    A         B
Grade Marks
G1    10    -0.824474 -3.048758
      20    -0.150286 -0.816731
G2    10     1.213255 -0.467578
      20     0.827297  1.084870

In [130]:
df.xs('G1')

              A         B
Marks
10    -0.824474 -3.048758
20    -0.150286 -0.816731

In [132]:
df.xs(['G1',20])

A   -0.150286
B   -0.816731
Name: (G1, 20), dtype: float64

In [133]:
df.xs(10,level='Marks')

              A         B
Grade
G1    -0.824474 -3.048758
G2     1.213255 -0.467578

In [134]:
df

                    A         B
Grade Marks
G1    10    -0.824474 -3.048758
      20    -0.150286 -0.816731
G2    10     1.213255 -0.467578
      20     0.827297  1.084870